/*
  * ===================================================================================
  * CopyRight By CHANGHONG NET L.T.D.
  * 文件: 	eis_api_media.h
  * 描述: 	实现媒体控制相关的接口
  * 作者:	 刘战芬，蒋庆洲
  * 时间:	2008-10-24
  * ===================================================================================
  */
#ifndef __EIS_API_MEDIA__
#define __EIS_API_MEDIA__

/*#define MP3_DATA此宏定义打开，采取底层解码MP3关上采取IPANEL解码MP3,需重新编译EIS和ch_mp3 2个目录*/


#endif

/*--eof---------------------------------------------------------------------------------------------------*/

